Some run(s) are deleted, so automatic landing is converted to sketched landing.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId AutomaticLandingConvertedToSketchedLandingWarning { get; }
  Visual Basic
Public Shared ReadOnly Property AutomaticLandingConvertedToSketchedLandingWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ AutomaticLandingConvertedToSketchedLandingWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace